src/Catalogs/Scan_АккумуляторныеБатареи/Scan_АккумуляторныеБатареи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_АккумуляторныеБатареи</name>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАКБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокАКБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/Scan_ДанныеПоАКБИзделий/Scan_ДанныеПоАКБИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ДанныеПоАКБИзделий</name>
  <comment>Данные по АКБ продуктов (scania)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПусковойТок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапряжениеБезНагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапряжениеПодНагрузкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Емкость</name>
    <type>
      <types>CatalogRef.Scan_ЕмкостиАКБ</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.Scan_СостоянияАКБ</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>АКБ</name>
    <type>
      <types>CatalogRef.Scan_АккумуляторныеБатареи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ХарактеристикиАКБ/Scan_ХарактеристикиАКБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ХарактеристикиАКБ</name>
  <enumValues>
    <name>Плотность</name>
  </enumValues>
  <enumValues>
    <name>ПусковойТок</name>
  </enumValues>
  <enumValues>
    <name>НапряжениеБезНагрузки</name>
  </enumValues>
  <enumValues>
    <name>НапряжениеПодНагрузкой</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_АккумуляторныеБатареи/Forms/ФормаЭлемента/Module.bsl
//rarus tenkam 07.09.2017 mantis 9425 +++

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураХарактеристик = РегистрыСведений.Scan_ДанныеПоАКБИзделий.ПолучитьХарактеристикиАКБ(Объект.Ссылка, ТекущаяДата());
		Если СтруктураХарактеристик <> Неопределено Тогда
			Плотность = СтруктураХарактеристик.Плотность;
			ПусковойТок = СтруктураХарактеристик.ПусковойТок;
			НапряжениеБезНагрузки = СтруктураХарактеристик.НапряжениеБезНагрузки;
			НапряжениеПодНагрузкой = СтруктураХарактеристик.НапряжениеПодНагрузкой;
			Емкость = СтруктураХарактеристик.Емкость;
			Состояние = СтруктураХарактеристик.Состояние;
			ДатаИзменения = СтруктураХарактеристик.ДатаИзменения;
			//Элементы.Состояние.ЦветФона = Состояние.Цвет.Получить();
		КонецЕсли;   
	КонецЕсли;
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	СтруктураХарактеристик = Новый Структура;
	СтруктураХарактеристик.Вставить("ПусковойТок", ПусковойТок);
	СтруктураХарактеристик.Вставить("Плотность", Плотность);
	СтруктураХарактеристик.Вставить("НапряжениеБезНагрузки", НапряжениеБезНагрузки);
	СтруктураХарактеристик.Вставить("НапряжениеПодНагрузкой", НапряжениеПодНагрузкой);
	СтруктураХарактеристик.Вставить("Емкость", Емкость);
	СтруктураХарактеристик.Вставить("Состояние", Состояние);
	РегистрыСведений.Scan_ДанныеПоАКБИзделий.ЗаписатьХарактеристикиАКБ(Объект.Ссылка,Объект.Изделие,СтруктураХарактеристик, ДатаИзменения);
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование()
	Объект.Наименование = Объект.Изделие.НомерИзделия + ", АКБ " + Объект.ПорядокАКБ + ", " + Объект.НомерАКБ;		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	СоответствиеХарактеристик = Новый Соответствие;
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.ПусковойТок"), ПусковойТок);
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.Плотность"), Плотность);
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеБезНагрузки"), НапряжениеБезНагрузки);
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеПодНагрузкой"), НапряжениеПодНагрузкой);
	СоответствиеХарактеристик.Вставить("Емкость", Емкость);
	Состояние = ПолучитьСостояние(СоответствиеХарактеристик);
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ПолучитьСостояние(СоответствиеХарактеристик)
	Возврат Справочники.Scan_СостоянияАКБ.ПолучитьСостояниеПоХарактеристикам(СоответствиеХарактеристик);	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 --- 
//rarus tenkam 07.09.2017 mantis 9425 ---
